# Дана строка. Преобразовать в ней все строчные буквы (как латинские, так и русские) в прописные.
original_string = "Строка С нАбоРом регИстрОв"
uppercase_string = original_string.upper()
print(uppercase_string)